docs/pages/algorithm/fenwick_tree.html
---
layout: default
title: Fenwick Tree
nav_exclude: true
---
<div id="outline-container-org25e3f17" class="outline-2">
<h2 id="org25e3f17"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
A Fenwick Tree is a binary indexed tree that allows efficient:
</p>
<ul class="org-ul">
<li>do range queries from [0, m] like (sum, max, min) in O(log n)</li>
<li>do point updates in O(log n)</li>
</ul>

<p>
The meaning of tree[node] represents the answer for the range covered by the left most binary bit.
</p>

<p>
Space used is n+1,
Fenwick Tree is using the left most binary bit of node index to represent the range.
For example:
node = 1 = 0001 in bin, the length of range covered by this node is 1
node = 4 = 0100 in bin, the lenght of range covered by this node is 4
node = 6 = 0110 in bin, the length of range covered by this node is 2
</p>


<p>
The query the range [0, 6], we have to query node=6 and node=4
</p>


<p>
<a href="https://youtu.be/uSFzHCZ4E-8">Youtube: Fenwick Tree (Binary Index Tree) Quick Tutorial and Source Code Explanation</a>
</p>

<p>
The Fenwick tree use the left most bit a lot, the followings are some tricks
</p>
<div class="org-src-container">
<pre class="src src-nil">i &amp; -i will give the left most binary bit
i - (i &amp; -i) will remove the left most binary bit
</pre>
</div>
</div>
</div>
<div id="outline-container-org601cccc" class="outline-2">
<h2 id="org601cccc"><span class="section-number-2">2.</span> code</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org19ddd7c" class="outline-3">
<h3 id="org19ddd7c"><span class="section-number-3">2.1.</span> template using fenwick tree to find the sum in range [0, node]</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt; <span style="color: #c678dd;">arr</span>(n);
<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt; <span style="color: #c678dd;">tree</span>(n+<span style="color: #da8548; font-weight: bold;">1</span>) <span style="color: #5B6268;">// </span><span style="color: #5B6268;">tree node start at index 1 not 0</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Fenwick Tree: update (0 based), increase node n and populate the effect to root</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">update</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">tree</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">node</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">incr</span>) {
  node ++;

  <span style="color: #5B6268;">//</span><span style="color: #5B6268;">populate to the parents</span>
  <span style="color: #51afef;">while</span>(node &lt; tree.size()) {
    tree[node] += incr;
    node += (node &amp; -node);    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">go to the parent by adding the left most binary bit</span>
  }
  <span style="color: #51afef;">return</span>;
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Fenwick Tree: query the range [0, i] (0 based) for the sum</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">query</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">tree</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">ans</span> = <span style="color: #da8548; font-weight: bold;">0</span>;
  i ++;
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">loop through each segment</span>
  <span style="color: #51afef;">while</span>(i&gt;<span style="color: #da8548; font-weight: bold;">0</span>) {
    ans += tree[i];
    i -= (i &amp; -i);
  }

  <span style="color: #51afef;">return</span> ans;
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">key idea, add the current node to it's immediate parent</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">build</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">tree</span>, <span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">arr</span>){
  copy(arr.begin(), arr.end(), tree.begin()+<span style="color: #da8548; font-weight: bold;">1</span>);

  <span style="color: #51afef;">for</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span>=<span style="color: #da8548; font-weight: bold;">1</span>; i&lt;tree.size(); i++) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">p</span> = i + (i &amp; -i);       <span style="color: #5B6268;">// </span><span style="color: #5B6268;">get the immediate parent</span>
    <span style="color: #51afef;">if</span>(p &lt; tree.size()) {
      tree[p] += tree[i];       <span style="color: #5B6268;">// </span><span style="color: #5B6268;">add to the parent</span>
    }
  }

  <span style="color: #51afef;">return</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org043fbca" class="outline-3">
<h3 id="org043fbca"><span class="section-number-3">2.2.</span> [limitation] template using fenwick tree to find the max element in range [0, node]</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Fenwick tree has some limitation when find the min or max element in range [0, node]. It does not allow updates.
</p>

<p>
Ex: update(1, 10) then update(1, 2) will make the tree wrong.
In a max-Fenwick Tree (like the one above), each bit[i] stores the maximum of some range. When you do:
tree[i] = std::max(tree[i], val);
…it only increases values. If you try to decrease (i.e., update a value at index i to a smaller one), the tree does not fix the max values in ancestors — so stale max values remain in the tree.
</p>


<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt; <span style="color: #c678dd;">arr</span>(n);
<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt; <span style="color: #c678dd;">tree</span>(n+<span style="color: #da8548; font-weight: bold;">1</span>);
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">update node value to val and populate the change</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">update</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">tree</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">node</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span>) {
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">tree is one based</span>
  node ++;

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">tree[node] gives the max element in current range, if current range, if the update val is smaller or equal</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">this applies to its parent</span>
  <span style="color: #51afef;">while</span>(node &lt; tree.size()) {

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">we can stop early if tree[node] &gt;= val</span>

    <span style="color: #51afef;">if</span>(tree[node] &gt;= val) {
      <span style="color: #51afef;">return</span> ;
    }

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now tree[node] &lt; val</span>
    tree[node] = val;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">go to the next parent node</span>
    node += (node &amp; -node);
  }
  <span style="color: #51afef;">return</span> ;
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">return the max element in the range [0, node]</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">query</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">tree</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">node</span>) {
  node ++;
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">ans</span> = INT_MIN;
  <span style="color: #51afef;">while</span>(node &gt; <span style="color: #da8548; font-weight: bold;">0</span>) {
    ans = max(ans, tree[node]);
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">go to ajcent node</span>
    node -= (node &amp; -node);
  }

  <span style="color: #51afef;">return</span> ans;
}

</pre>
</div>
</div>
</div>
</div>
